Revit 2026 API

# PrintManagerPaperSizes Property

---

Get all print sizes of current printer.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PaperSizeSet PaperSizes { get; }
```
```vb
Public ReadOnly Property PaperSizes As PaperSizeSet
	Get
```
```cpp
public:
property PaperSizeSet^ PaperSizes {
	PaperSizeSet^ get ();
}
```
```fsharp
member PaperSizes : PaperSizeSet with get
```

#### Property Value

PaperSizeSet

These are the valid paper sizes for the current printer.

#### Reference

PrintManager Class

Autodesk.Revit.DB Namespace